{
  "main": {
    "name": "Preeti Kumari",
    "occupation": "Front End Developer",
    "companyName": "Optimum Solutions Pte Ltd",
    "clientName": "United Overseas Bank",
    "currentRole": "Lead Developer",
    "description": "Full Stack React Developer by Day, Founder && Freelancer by Night. #papaReact",
    "image": "profile-pic.jpeg",
    "bio": "My name is Preeti, I'm currently working in Singapore on work permit. I have a profound knowledge in Technologies such as Javascript, React JS, HTML5, CSS3, Node JS, Git etc with a strong communication skill. I also have a deep understanding of Agile methodolgy and have done multiple projects in this. I believe in constant learning and I spend my free time answering questions on Stack overflow, writing travel blogs, playing sports or learning something new. I consider my biggest strengths as being a great Team Player and always being ready for new challenges.",
    "email": "pk.preetik@outlook.com",
    "phone": "+65 96108648",
    "address": {
      "street": "123 Fake Street",
      "city": "Singapore",
      "state": "Singapore",
      "zip": "ABC 123"
    },
    "resumedownload": "https://drive.google.com/file/d/1BEtmQ_wQu3iU1riaMW2YoObCrnyWyOW6/view?usp=sharing",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/preeti-kumari-03a54092/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "stackOverflow",
        "url": "https://stackoverflow.com/users/5515908/techie-questie",
        "className": "fa fa-stack-overflow"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "Sathyabama University",
        "degree": "Bachelors of Engineering in Electronics & TeleCommunications",
        "graduated": "April 2012",
        "description": "I have been in first 5 toppers of ETCE department. I also worked as one of the core team members of a Satellite Project(by ISRO) in college.",
        "location": "Chennai, TamilNadu, India"
      },
      {
        "school": "Banasthali University",
        "degree": "Senior Secondary Education",
        "graduated": "June 2007",
        "location": "Banasthali, Rajasthan, India"
      },
      {
        "school": "Banasthali University",
        "degree": "Secondary Education",
        "graduated": "June 2005",
        "location": "Banasthali, Rajasthan, India"
      }
    ],
    "work": [
      {
        "company": "United Overseas Bank",
        "title": "Lead Developer && React Specialist",
        "years": "September 2019 - Present",
        "location": "Singapore, Singapore",
        "description": "Currently working as a lead developer for a UOB-NexGen Infinity Digital Banking application. Involved in performance fine-tuning, code-debugging, component development, PR Reviews, co-ordinating across teams etc. Acknowledged and appreciated by client for project deliverables."
      },
      {
        "company": "Deloitte Digital",
        "title": "Lead Developer && Front End Specialist",
        "years": "May 2015 - August 2019",
        "location": "Bengaluru, Karnataka, India",
        "description": "Started as a Junior Front End Developer and have been awarded with two promotions for my exemplary performance. Worked as a Senior Developer for various domains such as insurance, e-commerce. Have been part of the first client project based on Blockchain in Deloitte and worked as an Individual contributor as well as a Lead Developer. Also, took part in multiple Hackathons involving ML, AR/VR."
      },
      {
        "company": "Cognizant Technology Solutions",
        "title": "UI/UX Developer",
        "years": "July 2012 - April 2015",
        "location": "Bengaluru, Karnataka, India",
        "description": "Worked as a Junior UI/UX developer. Involved in creating static client side pages for Healthcare Domain. Have also been involved in designing."
      }
    ],
    "skills": [
      {
        "name": "ReactJs",
        "level": "77%"
      },
      {
        "name": "Javascript",
        "level": "75%"
      },
      {
        "name": "CSS",
        "level": "95%"
      },
      {
        "name": "Git",
        "level": "90%"
      },
      {
        "name": "HTML5",
        "level": "80%"
      },
      {
        "name": "Node JS",
        "level": "80%"
      },
      {
        "name": "MongoDB",
        "level": "60%"
      },
      {
        "name": "Bootstrap4",
        "level": "80%"
      },
      {
        "name": "Material UI",
        "level": "70%"
      },
      {
        "name": "Webpack",
        "level": "70%"
      },
      {
        "name": "Agile",
        "level": "80%"
      },
      {
        "name": "Blockchain",
        "level": "20%"
      }
    ],
    "extraCurriculars": [
      {
        "description": "Collaborated in a team of 15-20 fellow volunteers to clean the Yelahanka Lake, Bengaluru,Karnataka and plantation of trees."
      },
      {
        "description": "Volunteered in Food prep, painting, craft-work for children in Samarthanam’s Special School, Bengaluru,Karnakata."
      },
      {
        "description": "Involved as an event co-ordinator with other fellow volunteers for teaching primary school students in an event organised by Deloitte USI called VidyaVahini in bengaluru, Karnataka."
      },
      {
        "description": "Organised College Fest and have played many Badminton tournaments conducted at college and organisation level."
      }
    ],
    "awards": [
      {
        "description": "Project Delivery Award at UOB for Singapore go live of Infinity Digital Banking application."
      },
      {
        "description": "SPOT Awards at Deloitte Consulting USI for Project Delivery and being a 2nd runner-up in a Hackathon for building a 2D game."
      },
      {
        "description": "Appreciation Award at Cognizant Technoloy Solutions for Project Delivery."
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "MERN Stack WhatsApp Clone",
        "category": "WhatsApp Clone built with MERN (MongoDB, ExpressJS, ReactJS, NodeJS)",
        "image": "whatsapp-mern.jpeg",
        "url": "https://www.youtube.com/watch?v=gzdQDxzW2Tw"
      },
      {
        "title": "MERN Stack TikTok Clone",
        "category": "TikTok Clone built with MERN (MongoDB, ExpressJS, ReactJS, NodeJS)",
        "image": "tiktok-mern.jpeg",
        "url": "https://www.youtube.com/watch?v=g8yGxDMyGiE"
      },
      {
        "title": "Facebook Clone with React",
        "category": "Facebook Clone built with ReactJS",
        "image": "facebook-clone.png",
        "url": "https://www.youtube.com/watch?v=B-kxUMHBxNo"
      },
      {
        "title": "Airbnb Clone",
        "category": "Facebook Clone built with ReactJS",
        "image": "airbnb-clone.jpeg",
        "url": "https://www.youtube.com/watch?v=BtJeH_-XYaA"
      },
      {
        "title": "Netflix Clone",
        "category": "Facebook Clone built with ReactJS",
        "image": "netflix-clone.jpeg",
        "url": "https://www.youtube.com/watch?v=XtMThy8QKqU&t=9358s"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Preeti is dynamic and self-motivated to work for stakeholder success. She was able to quickly adapt and learn newer technologies such as React(both JS & Native). She is a team player and would be a good addition to any project. She has worked with me in Insurance Custom Dev. project and has supported skills for full stack development with a preference to work on Front End. She was also mentoring a fresh graduate to build skills for client delivery. I wish her all the best for her career.",
        "user": "Alpesh Makwana - Ex Supervisor"
      },
      {
        "text": "Preeti is an enthusiastic person with dynamic skills, we both together in one of the healthcare project which was in a fire fighting mode to meet the delivery schedule.she had delivered the designs in a very specular way streamlined to the customer requirements.The exceptionality identified was on to Team Management, Meeting the delivery lines putting extra hours beyond the scheduled timelines and taking individual ownership being a starter. I really appreciate preeti for her hard earned efforts which had been recognised and wish all success in same pace for future assignments.",
        "user": "Renjith G - Ex Supervisor"
      },
      {
        "text": "Preeti had worked with me for the tenure of more than a year. She was one of best performers in the team. Being one of smart and active contributor, she managed to contribute towards complex technical solutioning. Her skills on FE technologies bring the project to high quality with 100% pass rate. All the best for her future achievements.",
        "user": "Vaibhav Aggarwal - Ex Supervisor"
      }
    ]
  }
}